# Задание-1:
# Напишите функцию, возвращающую ряд Фибоначчи с n-элемента до m-элемента.
# Первыми элементами ряда считать цифры 1 1

print('Задача-1.Решение-1.')
def fibonacci(n, m):
    a = [1, 1]
    i = 0
    while i <= m:
        first = int(a[i])
        second = int(a[i+1])
        third = first + second
        a.append(third)
        i += 1
    print(a[n: m])
fibonacci(0,5)

# Задача-2:
# Напишите функцию, сортирующую принимаемый список по возрастанию.
# Для сортировки используйте любой алгоритм (например пузырьковый).
# Для решения данной задачи нельзя использовать встроенную функцию и метод sort()

print('Задача-2.Решение-1.')
def sort_to_max(origin_list):
    a = origin_list
    for i in range(len(a), 0, -1):
        for j in range(1, i):
            if a[j-1] > a[j]:
                tmp = a[j-1]
                a[j-1] = a[j]
                a[j] = tmp
                print(a)
    return(a)
sort_to_max([2, 10, -12, 2.5, 20, -11, 4, 4, 0])


# Задача-3:
# Напишите собственную реализацию стандартной функции filter.
# Разумеется, внутри нельзя использовать саму функцию filter.

# def func(m):
#     if m > 0:
#         return 1
#     else:
#         return 0
# a = [1, -4, 6, 8, -10]

print('Задача-3.Решение-1.')
def my_filter(func, a):
    result = []
    for i in a:
        if func(i):
            result.append(i)
    return result

# print(my_filter(func, a))


# Задача-4:
# Даны четыре точки А1(х1, у1), А2(x2 ,у2), А3(x3 , у3), А4(х4, у4).
# Определить, будут ли они вершинами параллелограмма.
import math

print('Задача-4.Решение-1.')
def parallelogram(A1, A2, A3, A4):
    x1 = A1[0]
    x2 = A2[0]
    x3 = A3[0]
    x4 = A4[0]
    y1 = A1[1]
    y2 = A1[1]
    y3 = A1[1]
    y4 = A1[1]
    A1A2 = (x2 - x1) ** 2 + (y2 - y1) ** 2
    A3A4 = (x3 - x4) ** 2 + (y3 - y4) ** 2
    A1A4 = (x4 - x1) ** 2 + (y4 - y1) ** 2
    A2A3 = (x3 - x2) ** 2 + (y3 - y2) ** 2
    A2A4 = (y2 - y4) ** 2 + (x4 - x2) ** 2
    A1A3 = (x3 - x1) ** 2 + (y3 - y1) ** 2
    if (A1A2 + A3A4 + A1A4 + A2A3) == (A2A4 + A1A3):
        print('Вершины образуют параллелограмм')
    else:
        print('Вершины не образуют параллелограмм')

A1, A2, A3, A4 = [1,1], [2,3], [4,4], [3,2]
parallelogram(A1, A2, A3, A4)